export const MESSAGES = {
  SUCCESS: {
    MSG00001: '問題を取得しました',
    MSG00002: 'Success!! 問題を追加できました!',
    MSG00003: '回答ログを削除しました(id:{0})',
    MSG00004: 'Success!! 全て更新しました',
    MSG00005: 'Success!! 全て更新しました(再検索してください)',
    MSG00006: '問題[{0}] にチェックをつけました',
    MSG00007: '問題[{0}] にチェックを外しました',
    MSG00008: '問題[{0}] 正解+1! 登録しました',
    MSG00009: 'Success! 削除に成功しました [{0}-{1}]',
    MSG00010: 'Success!! 問題を更新できました!',
    MSG00011: '問題[{0}] 不正解+1.. 登録しました',
    MSG00012: '新規ファイル「{0}」を追加しました',
    MSG00013: 'ファイルを削除しました(id:{0})',
    MSG00014: 'Success! 統合に成功しました[{0}:{1}->{2}]',
    MSG00015: 'Success!! {0}問の問題を取得しました',
    MSG00016: '新規格言「{0}」を追加しました',
    MSG00017: '新規本「{0}」を追加しました',
    MSG00018: 'Success!! 編集に成功しました',
    MSG00019: 'Success!! 取得しました'
  },
  ERROR: {
    MSG00001: 'エラー:問題ファイルを選択して下さい',
    MSG00002: 'エラー:問題番号を入力して下さい',
    MSG00003: 'エラー:条件に合致するデータはありません',
    MSG00004: 'エラー:外部APIとの連携に失敗しました',
    MSG00005: 'エラー:問題文及び答えを入力して下さい',
    MSG00006: 'エラー:問題形式不正:{0}',
    MSG00007: 'エラー:問題番号がありません',
    MSG00008: 'エラー:問題を出題してから登録して下さい',
    MSG00009: 'エラー:削除する問題を取得して下さい',
    MSG00010: 'エラー:削除する問題・ファイルを取得して下さい',
    MSG00011: 'エラー:本名を選択して下さい',
    MSG00012: 'エラー:格言を入力して下さい',
    MSG00013: 'エラー:本の名前を入力して下さい',
    MSG00014: 'エラー:入力したIDが不正です:{0}'
  },
  DEFAULT: {
    MSG00001: '　'
  }
}
